## Day 7

In [1]:
Dataset="F:\\UPX_TechM\\Data Analytic\\Practicals\\Datasets"

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

1. Function
   - lambda function
2.	exception handling
3.	sets
4.	Modules
5.	Numpy
6.  **Panda <--**    
```
Sit on top of numpy
```
```
It has tabular struc
```
```
data mani, clean, merging, pivot anything to do with data
```

In [3]:
import numpy as np
import pandas as pd

In [4]:
from matplotlib import pyplot as py

In [5]:
indexing=np.round(np.random.random(64).reshape(16,4),2)
indexing

array([[0.75, 0.06, 0.71, 0.09],
       [0.49, 0.94, 0.09, 0.61],
       [0.38, 0.92, 0.96, 0.78],
       [0.5 , 0.19, 0.77, 0.33],
       [0.09, 0.94, 0.48, 0.74],
       [0.57, 0.37, 0.69, 0.24],
       [0.24, 0.94, 0.37, 0.61],
       [0.77, 0.56, 0.19, 0.69],
       [0.64, 0.9 , 0.68, 0.52],
       [0.83, 0.64, 0.75, 0.55],
       [0.89, 0.29, 0.36, 0.15],
       [0.85, 0.54, 0.16, 0.56],
       [0.6 , 0.79, 0.95, 0.58],
       [0.71, 0.03, 0.01, 0.17],
       [0.55, 0.02, 0.1 , 0.31],
       [0.63, 0.84, 0.72, 0.6 ]])

In [6]:
sin_indexing=np.sin(indexing)

In [7]:
sin_indexing

array([[0.68163876, 0.05996401, 0.65183377, 0.08987855],
       [0.47062589, 0.8075581 , 0.08987855, 0.57286746],
       [0.37092047, 0.79560162, 0.81919157, 0.70327942],
       [0.47942554, 0.18885889, 0.69613524, 0.32404303],
       [0.08987855, 0.8075581 , 0.46177918, 0.67428791],
       [0.53963205, 0.36161543, 0.63653718, 0.23770263],
       [0.23770263, 0.8075581 , 0.36161543, 0.57286746],
       [0.69613524, 0.5311862 , 0.18885889, 0.63653718],
       [0.59719544, 0.78332691, 0.62879302, 0.49688014],
       [0.73793137, 0.59719544, 0.68163876, 0.52268723],
       [0.77707175, 0.28595223, 0.35227423, 0.14943813],
       [0.75128041, 0.51413599, 0.15931821, 0.5311862 ],
       [0.56464247, 0.71035327, 0.8134155 , 0.54802394],
       [0.65183377, 0.0299955 , 0.00999983, 0.16918235],
       [0.52268723, 0.01999867, 0.09983342, 0.30505864],
       [0.58914476, 0.74464312, 0.65938467, 0.56464247]])

In [8]:
emp=pd.read_csv(Dataset+"\\employees.csv")

In [9]:
emp.head()# top 5 rows

,Emp ID,Name Prefix,First Name,Middle Initial,Last Name,Gender,E Mail,Father's Name,Mother's Name,Mother's Maiden Name,...,SSN,Phone No.,Place Name,County,City,State,Zip,Region,User Name,Password
0,677509,Drs.,Lois,H,Walker,F,lois.walker@hotmail.com,Donald Walker,Helen Walker,Lewis,...,467-99-4677,303-572-8492,Denver,Denver,Denver,CO,80224,West,lhwalker,DCa}.T}X:v?NP
1,940761,Ms.,Brenda,S,Robinson,F,brenda.robinson@gmail.com,Raymond Robinson,Judy Robinson,Perry,...,537-71-4566,225-945-4954,Stonewall,De Soto,Stonewall,LA,71078,South,bsrobinson,TCo\j#Zg;SQ~o
2,428945,Dr.,Joe,W,Robinson,M,joe.robinson@gmail.com,Scott Robinson,Stephanie Robinson,Taylor,...,025-92-3584,219-904-2161,Michigantown,Clinton,Michigantown,IN,46057,Midwest,jwrobinson,GO4$J8MiEh[A
3,408351,Drs.,Diane,I,Evans,F,diane.evans@yahoo.com,Jason Evans,Michelle Evans,Allen,...,314-35-9851,215-793-6791,Hydetown,Crawford,Hydetown,PA,16328,Northeast,dievans,0gGRtp1HfL<r5
4,193819,Mr.,Benjamin,R,Russell,M,benjamin.russell@charter.net,Gregory Russell,Elizabeth Russell,Nelson,...,121-98-7248,262-404-2252,Fremont,Waupaca,Fremont,WI,54940,Midwest,brrussell,Rd<Y8cp!@R;*%F

In [10]:
emp.tail() #bottom 5 rows

,Emp ID,Name Prefix,First Name,Middle Initial,Last Name,Gender,E Mail,Father's Name,Mother's Name,Mother's Maiden Name,...,SSN,Phone No.,Place Name,County,City,State,Zip,Region,User Name,Password
95,639892,Mr.,Jose,K,Hill,M,jose.hill@hotmail.com,Carlos Hill,Anna Hill,Hayes,...,171-86-3825,228-245-5000,Biloxi,Harrison,Biloxi,MS,39532,South,jkhill,a_!SKb6h3?w*Mad
96,704709,Dr.,Harold,Z,Nelson,M,harold.nelson@gmail.com,Richard Nelson,Pamela Nelson,Smith,...,456-99-2066,217-555-9216,Carol Stream,Carol Stream,Carol Stream,IL,60351,Midwest,hznelson,z/-hEz3&^q5
97,461593,Ms.,Nicole,O,Ward,F,nicole.ward@yahoo.com,Ralph Ward,Julia Ward,Lee,...,196-84-2551,231-761-7861,Detroit,Wayne,Detroit,MI,48278,Midwest,noward,AUe6s0@:@]A3Ze
98,392491,Mrs.,Theresa,R,Murphy,F,theresa.murphy@gmail.com,George Murphy,Jacqueline Murphy,Peterson,...,249-99-8801,907-356-1555,Mc Grath,Yukon-Koyukuk (CA),Mc Grath,AK,99627,West,trmurphy,V]PGw>4h9
99,495141,Drs.,Tammy,B,Young,F,tammy.young@comcast.net,Andrew Young,Brenda Young,Robinson,...,771-02-7046,231-290-3075,Alma,Gratiot,Alma,MI,48801,Midwest,tbyoung,d6!&xu12A1H^i![

In [11]:
type(emp)

pandas.core.frame.DataFrame

In [12]:
emp.head(10) # top 10 rows

,Emp ID,Name Prefix,First Name,Middle Initial,Last Name,Gender,E Mail,Father's Name,Mother's Name,Mother's Maiden Name,...,SSN,Phone No.,Place Name,County,City,State,Zip,Region,User Name,Password
0,677509,Drs.,Lois,H,Walker,F,lois.walker@hotmail.com,Donald Walker,Helen Walker,Lewis,...,467-99-4677,303-572-8492,Denver,Denver,Denver,CO,80224,West,lhwalker,DCa}.T}X:v?NP
1,940761,Ms.,Brenda,S,Robinson,F,brenda.robinson@gmail.com,Raymond Robinson,Judy Robinson,Perry,...,537-71-4566,225-945-4954,Stonewall,De Soto,Stonewall,LA,71078,South,bsrobinson,TCo\j#Zg;SQ~o
2,428945,Dr.,Joe,W,Robinson,M,joe.robinson@gmail.com,Scott Robinson,Stephanie Robinson,Taylor,...,025-92-3584,219-904-2161,Michigantown,Clinton,Michigantown,IN,46057,Midwest,jwrobinson,GO4$J8MiEh[A
3,408351,Drs.,Diane,I,Evans,F,diane.evans@yahoo.com,Jason Evans,Michelle Evans,Allen,...,314-35-9851,215-793-6791,Hydetown,Crawford,Hydetown,PA,16328,Northeast,dievans,0gGRtp1HfL<r5
4,193819,Mr.,Benjamin,R,Russell,M,benjamin.russell@charter.net,Gregory Russell,Elizabeth Russell,Nelson,...,121-98-7248,262-404-2252,Fremont,Waupaca,Fremont,WI,54940,Midwest,brrussell,Rd<Y8cp!@R;*%F
5,499687,Mr.,Patrick,F,Bailey,M,patrick.bailey@aol.com,Ralph Bailey,Laura Bailey,Henderson,...,439-99-7721,319-812-6957,Macksburg,Madison,Macksburg,IA,50155,Midwest,pfbailey,K7&5aY/*
6,539712,Ms.,Nancy,T,Baker,F,nancy.baker@bp.com,Scott Baker,Judy Baker,Thomas,...,641-29-2071,229-336-5117,Atlanta,Fulton,Atlanta,GA,30334,South,ntbaker,xJdKlAcYQhT_BE#
7,380086,Mrs.,Carol,V,Murphy,F,carol.murphy@gmail.com,Eugene Murphy,Katherine Murphy,Peterson,...,423-67-7023,216-336-0009,Blanchester,Clinton,Blanchester,OH,45107,Midwest,cvmurphy,Uc+VG%vuZU<k
8,477616,Hon.,Frances,B,Young,F,frances.young@gmail.com,Fred Young,Lillian Young,Diaz,...,028-92-8912,210-819-9765,Delmita,Starr,Delmita,TX,78536,South,fbyoung,K}^USc0l7[A
9,162402,Hon.,Diana,T,Peterson,F,diana.peterson@hotmail.co.uk,Jonathan Peterson,Christina Peterson,Ross,...,512-33-6767,479-783-5656,Eureka Springs,Carroll,Eureka Springs,AR,72632,South,dtpeterson,3o8>v&tYxjyEAo

In [13]:
emp.columns

Index(['Emp ID', 'Name Prefix', 'First Name', 'Middle Initial', 'Last Name',
       'Gender', 'E Mail', 'Father's Name', 'Mother's Name',
       'Mother's Maiden Name', 'Date of Birth', 'Time of Birth', 'Age in Yrs.',
       'Weight in Kgs.', 'Date of Joining', 'Quarter of Joining',
       'Half of Joining', 'Year of Joining', 'Month of Joining',
       'Month Name of Joining', 'Short Month', 'Day of Joining',
       'DOW of Joining', 'Short DOW', 'Age in Company (Years)', 'Salary',
       'Last % Hike', 'SSN', 'Phone No. ', 'Place Name', 'County', 'City',
       'State', 'Zip', 'Region', 'User Name', 'Password'],
      dtype='object')

In [14]:
emp.sample(10) # random 10 records

,Emp ID,Name Prefix,First Name,Middle Initial,Last Name,Gender,E Mail,Father's Name,Mother's Name,Mother's Maiden Name,...,SSN,Phone No.,Place Name,County,City,State,Zip,Region,User Name,Password
23,388642,Mrs.,Ruby,R,Rogers,F,ruby.rogers@gmail.com,Ronald Rogers,Teresa Rogers,Alexander,...,236-55-0172,423-231-6507,Woodbury,Cannon,Woodbury,TN,37190,South,rrrogers,t>#P@D9s<:9\V
38,726264,Hon.,Carl,N,Collins,M,carl.collins@yahoo.com,Gerald Collins,Phyllis Collins,Rodriguez,...,544-81-6171,479-740-7633,Wright,Jefferson,Wright,AR,72182,South,cncollins,XinULSmjAFL/
9,162402,Hon.,Diana,T,Peterson,F,diana.peterson@hotmail.co.uk,Jonathan Peterson,Christina Peterson,Ross,...,512-33-6767,479-783-5656,Eureka Springs,Carroll,Eureka Springs,AR,72632,South,dtpeterson,3o8>v&tYxjyEAo
78,806955,Mr.,William,G,Hernandez,M,william.hernandez@rediffmail.com,Peter Hernandez,Deborah Hernandez,Jones,...,629-31-9010,239-276-0532,Mary Esther,Okaloosa,Mary Esther,FL,32569,South,wghernandez,BRB3DFywgZZ4
21,969580,Prof.,Matthew,L,Turner,M,matthew.turner@gmail.com,Jose Turner,Kathy Turner,Cox,...,598-92-1988,236-972-7624,Heathsville,Northumberland,Heathsville,VA,22473,South,mlturner,I>tL>d[|lZdi_|^
26,263480,Hon.,Daniel,K,Cooper,M,daniel.cooper@yahoo.com,Louis Cooper,Julie Cooper,Murphy,...,181-86-2024,701-510-8162,Manning,Dunn,Manning,ND,58642,Midwest,dkcooper,d8p{Pwx2fsW0-Z
45,226714,Drs.,Nancy,L,Davis,F,nancy.davis@ibm.com,Bruce Davis,Jessica Davis,Moore,...,224-99-5928,219-610-3067,Bowling Green,Clay,Bowling Green,IN,47833,Midwest,nldavis,bv-KfTutT?0*pm
68,293459,Mr.,Steven,J,Phillips,M,steven.phillips@hotmail.com,Jason Phillips,Gloria Phillips,Lewis,...,578-53-9940,225-968-5952,Baton Rouge,East Baton Rouge,Baton Rouge,LA,70833,South,sjphillips,ht}X55$P&g1
41,227922,Hon.,Amanda,M,Hughes,F,amanda.hughes@rediffmail.com,Roy Hughes,Cynthia Hughes,Bryant,...,311-35-2540,225-544-9700,Lake Charles,Calcasieu,Lake Charles,LA,70605,South,amhughes,B2N>J{_k7]F
0,677509,Drs.,Lois,H,Walker,F,lois.walker@hotmail.com,Donald Walker,Helen Walker,Lewis,...,467-99-4677,303-572-8492,Denver,Denver,Denver,CO,80224,West,lhwalker,DCa}.T}X:v?NP

In [15]:
emp.shape

(100, 37)

In [16]:
emp.describe()

,Emp ID,Age in Yrs.,Weight in Kgs.,Year of Joining,Month of Joining,Day of Joining,Age in Company (Years),Salary,Zip
count,100.00000,100.000000,100.000000,100.000000,100.000000,100.000000,100.000000,100.000000,100.000000
mean,547652.10000,39.238700,58.080000,2008.120000,6.250000,16.370000,8.978400,119738.090000,53011.230000
std,257664.16679,12.066252,12.294106,8.642484,3.453515,9.403046,8.657358,46185.278194,23007.336848
min,134841.00000,21.100000,40.000000,1983.000000,1.000000,1.000000,0.020000,42005.000000,3867.000000
25%,328643.75000,28.177500,50.000000,2003.000000,3.000000,7.000000,2.152500,83979.750000,37580.500000
50%,497414.00000,37.595000,56.000000,2010.500000,7.000000,18.000000,6.435000,118049.500000,52855.000000
75%,766040.00000,49.900000,61.250000,2015.000000,8.250000,24.000000,13.762500,162509.250000,69514.500000
max,979607.00000,59.470000,90.000000,2017.000000,12.000000,31.000000,34.520000,197537.000000,99791.000000

In [17]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 37 columns):
Emp ID                    100 non-null int64
Name Prefix               100 non-null object
First Name                100 non-null object
Middle Initial            100 non-null object
Last Name                 100 non-null object
Gender                    100 non-null object
E Mail                    100 non-null object
Father's Name             100 non-null object
Mother's Name             100 non-null object
Mother's Maiden Name      100 non-null object
Date of Birth             100 non-null object
Time of Birth             100 non-null object
Age in Yrs.               100 non-null float64
Weight in Kgs.            100 non-null int64
Date of Joining           100 non-null object
Quarter of Joining        100 non-null object
Half of Joining           100 non-null object
Year of Joining           100 non-null int64
Month of Joining          100 non-null int64
Month Name of Joining     100 non-null object
Short Month               100 non-null object
Day of Joining            100 non-null int64
DOW of Joining            100 non-null object
Short DOW                 100 non-null object
Age in Company (Years)    100 non-null float64
Salary                    100 non-null int64
Last % Hike               100 non-null object
SSN                       100 non-null object
Phone No.                 100 non-null object
Place Name                100 non-null object
County                    100 non-null object
City                      100 non-null object
State                     100 non-null object
Zip                       100 non-null int64
Region                    100 non-null object
User Name                 100 non-null object
Password                  100 non-null object
dtypes: float64(2), int64(7), object(28)
memory usage: 29.0+ KB

# Lets get hand dirty

``` There are two type of data structure in panda```

1. Series : which is similar to numpy 1D array . In here in addition it assign default index.

2. DataFrame :It is tabular data structure in which data is laid out in rows and columns format similar to csv, SQL file, but can also be used for higher dimensional data sets. DataFrame object can contain homogenous and hetrogenous values and can thought of logical extension of series data structure. In contrast to series where there is one index a Dataframe has one index for columns  and one index for rows. This allow flexiblity accessing and manipulating data`

In [18]:
series =pd.Series([12,13,14,15,16,17])
series
series.values
series.index

0    12
1    13
2    14
3    15
4    16
5    17
dtype: int64

array([12, 13, 14, 15, 16, 17], dtype=int64)

RangeIndex(start=0, stop=6, step=1)

In [19]:
series1=pd.Series([12,13,14,15,16,17], index=['one','two','three','four','five','six'])
series1

one      12
two      13
three    14
four     15
five     16
six      17
dtype: int64

In [20]:
series1.values
series1.index

array([12, 13, 14, 15, 16, 17], dtype=int64)

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [21]:
series1[2]
series1['three']

14

14

In [22]:
series1[['one','two']] # Accessing using user defined index to get multiple value

one    12
two    13
dtype: int64

In [23]:
series1[[1,3]]

two     13
four    15
dtype: int64

In [24]:
series1.index # index is of object type
series1.values # values is of integer type

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

array([12, 13, 14, 15, 16, 17], dtype=int64)

In [25]:
series1 + 4 # add 4 to all element of the series

one      16
two      17
three    18
four     19
five     20
six      21
dtype: int64

In [26]:
series1 ** 2

one      144
two      169
three    196
four     225
five     256
six      289
dtype: int64

In [27]:
series1[series1>13]

three    14
four     15
five     16
six      17
dtype: int64

In [28]:
series1
np.sqrt(series1) # using numpy square root  feature on series

one      12
two      13
three    14
four     15
five     16
six      17
dtype: int64

one      3.464102
two      3.605551
three    3.741657
four     3.872983
five     4.000000
six      4.123106
dtype: float64

In [29]:
yrs=[30,40,50,60,70,80,90]
f1={30:1,40:2,50:7,60:3,70:4,80:5,90:6}
firm1=pd.Series(f1,index=yrs)
firm1
firm2=pd.Series(f1)
firm2

30    1
40    2
50    7
60    3
70    4
80    5
90    6
dtype: int64

30    1
40    2
50    7
60    3
70    4
80    5
90    6
dtype: int64

In [30]:
yrs=[30,40,50,60,70,80,90,97]
f3={20:1,30:2,40:7,60:3,70:4,80:5,90:6}
firm3=pd.Series(f3,index=yrs) # since we dont have 20 in the list to map it will not be stored in firm2 series
firm3
firm4=pd.Series(f3)
firm4

30    2.0
40    7.0
50    NaN
60    3.0
70    4.0
80    5.0
90    6.0
97    NaN
dtype: float64

20    1
30    2
40    7
60    3
70    4
80    5
90    6
dtype: int64

```NaN  stand for missing or not applicable values use isnull function find out those missing values in data structure```

In [31]:
pd.isnull(firm3)

30    False
40    False
50     True
60    False
70    False
80    False
90    False
97     True
dtype: bool

```Key feature of series data is structure we dont need to worry about of data allignment```

In [32]:
dict1={'finance': 8, 'earning':23, 'debt':12}
dict2={'finance': 8, 'compensation':23, 'earning':12}
count1=pd.Series(dict1)
count2=pd.Series(dict2)
print(count1)
count2

debt       12
earning    23
finance     8
dtype: int64

compensation    23
earning         12
finance          8
dtype: int64

In [33]:
print(type(count1))
count1+count2

<class 'pandas.core.series.Series'>

compensation     NaN
debt             NaN
earning         35.0
finance         16.0
dtype: float64

In [34]:
count3=count1+count2

In [35]:
print(count3)
print(count3.values)
print(count3.index)

compensation     NaN
debt             NaN
earning         35.0
finance         16.0
dtype: float64
[nan nan 35. 16.]
Index(['compensation', 'debt', 'earning', 'finance'], dtype='object')

```Data frame is tabular data structure in which data is laid out in rows and columns format similar to csv, SQL file, but can also be used for higher dimensional data sets. DataFrame object can contain homogenous and hetrogenous values and can thought of logical extension of series data structure. In contrast to series where there is one index a Dataframe has one index for columns  and one index for rows. This allow flexiblity accessing and manipulating data```

In [36]:
data= pd.DataFrame({'price':[12,23,23,32],
                     'ticker':['abc','def','ghi','jkl'],
                    'company':['pqr','stu','vwx','lmn']})

In [37]:
data

  company  price ticker
0     pqr     12    abc
1     stu     23    def
2     vwx     23    ghi
3     lmn     32    jkl

In [38]:
data['company']
data['ticker']

0    pqr
1    stu
2    vwx
3    lmn
Name: company, dtype: object

0    abc
1    def
2    ghi
3    jkl
Name: ticker, dtype: object

In [39]:
data[2:]

  company  price ticker
2     vwx     23    ghi
3     lmn     32    jkl

In [40]:
data.iloc[3,2]

'jkl'

In [41]:
data.iloc[0:2]
data.iloc[0:2,:] # It render same result its recommended to second way so avoid confusion.

  company  price ticker
0     pqr     12    abc
1     stu     23    def

  company  price ticker
0     pqr     12    abc
1     stu     23    def

In [42]:
data.iloc[0:,1:]

   price ticker
0     12    abc
1     23    def
2     23    ghi
3     32    jkl

In [43]:
data.iloc[0:,1] # iloc always works with index to pull data

0    12
1    23
2    23
3    32
Name: price, dtype: int64

In [44]:
data.loc[[2],['ticker']] # loc is felixible to work with label and index to fetch data.

  ticker
2    ghi

In [45]:
data.loc[2:3,['ticker','price']]

  ticker  price
2    ghi     23
3    jkl     32

In [46]:
data.loc[:,['company']]

  company
0     pqr
1     stu
2     vwx
3     lmn

In [47]:
data.loc[[0,:]

SyntaxError: invalid syntax (<ipython-input-47-f12b51521777>, line 1)

In [ ]:
data[data.price>2]

In [ ]:
data['year']=2014

In [ ]:
data

In [ ]:
data['pricesquared']=data.price**2

In [ ]:
data

In [ ]:
data['sqrtprice']=np.sqrt(data.pricesquared)

In [ ]:
data

In [ ]:
del data['pricesquared']

In [ ]:
data

In [ ]:
data['pricesquared']=np.NaN

In [ ]:
data

In [ ]:
data['sequence']=np.arange(1,5)

In [ ]:
data

In [ ]:
data.values

In [ ]:
data.shape

In [ ]:
data.mean()
data.median()
data.std()
data.describe()
data.info()